##Рекуомендую оформлять свой файл следующим образом

##  1.
# импортируем все библиотеки

# import streamlit as st
# from st_pages import Page, show_pages, add_page_title
# ........
# ........

##  2.
#  задаем название слайда на панели слева
# st.sidebar.title("MATPLOTLIb")


##  3.
# задаем заголовок слайда
# st.title('Элементы оформления')


##  4.
# Так можно писать текст

# Текст побольше
#st.subheader(" Текст ")

# Текст поменьше
# r'''Текст'''
# st.write('1234')
#

##  5.
#  Так можно оформить код
# st.code(code, language='python')
# st.subheader("Код данной функции")
# code = """ Вставляем свой код """


## 6.
# Рекомендую так офррлять свой файл

# 6.1 Для каждой отдельной большой задачи создаем свою функцию
# например
# def plot_sinus_graph(.....)

# 6.2
# Вызываем эту функцию в функции main

# 6.3 Вызываем функцию саму функцию main так
# if __name__ == '__main__':
#     main()
#

# Добавляйте что-то свое чтобы не потерять)
# ...
